{
  "architectures": [
    "ErnieForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "enable_recompute": false,
  "fuse": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "non-rumor",
    "1": "rumor",
    "2": "unverified"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "non-rumor": 0,
    "rumor": 1,
    "unverified": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "ernie",
  "num_attention_heads": 16,
  "num_hidden_layers": 20,
  "pad_token_id": 0,
  "paddlenlp_version": null,
  "pool_act": "tanh",
  "task_id": 0,
  "task_type_vocab_size": 16,
  "type_vocab_size": 4,
  "use_task_id": true,
  "vocab_size": 40000
}
